import termcolor
import misc_.ui as ui


def handler() -> str:
  print("""
-------------------------------------------------------
|                                                     |
|                                                     |
|    ░█████╗░██╗░░░░░██╗  ██╗░░░░░░█████╗░██████╗░    |
|    ██╔══██╗██║░░░░░██║  ██║░░░░░██╔══██╗██╔══██╗    |
|    ███████║██║░░░░░██║  ██║░░░░░███████║██████╦╝    |
|    ██╔══██║██║░░░░░██║  ██║░░░░░██╔══██║██╔══██╗    |
|    ██║░░██║███████╗██║  ███████╗██║░░██║██████╦╝    |
|    ╚═╝░░╚═╝╚══════╝╚═╝  ╚══════╝╚═╝░░╚═╝╚═════╝░    |
|                                                     |
-------------------------------------------------------

█░░ ▄▀█ █▄▄ █▀   █▀▄▀█ ▄▀█ █▀▄ █▀▀   █▀▄ █ █▀▀ █ ▀█▀ ▄▀█ █░░
█▄▄ █▀█ █▄█ ▄█   █░▀░█ █▀█ █▄▀ ██▄   █▄▀ █ █▄█ █ ░█░ █▀█ █▄▄







█▀ █▀▀ █▀█ █░█ █ █▀▀ █▀▀ █▀
▄█ ██▄ █▀▄ ▀▄▀ █ █▄▄ ██▄ ▄█

－ Ｃｒｅａｔｅ Ｌａｂ Ｇｒｏｕｐｓ

－ Ｈｏｓｔ Ｌａｂ ｓｅｓｓｉｏｎｓ

－ Ｍａｎａｇｅ ｓｔｕｄｅｎｔ ａｔｔｅｎｄａｎｃｅ

－ Ｍａｎａｇｅ ａｃｔｉｖｉｔｙ ｃｏｍｐｌｅｔｉｏｎ

－ Ｓｔｏｒｅ ａｃｔｉｖｉｔｙ ｄａｔａ

－ Ｔｅａｃｈｅｒ ａｎｄ Ｓｔｕｄｅｎｔ Ａｃｃｏｕｎｔｓ


        
Ｃｏｍｍａｎｄｓ:
        
-> Ｐｒｅｓｓ ［ Ｑ ］ ａｎｄ ｈｉｔ ［ ＥＮＴＥＲ ］ ｔｏ ｑｕｉｔ．
        
-> Ｐｒｅｓｓ ［ ＥＮＴＥＲ ］ ｔｏ ｉｎｉｔｉａｔｅ  ａｃｃｅｓｓ.

""")
  choice = input()
  if choice.lower() == "q":
    return ("AUTH",True)
  else:
    return ("AUTH",False)
